Flow_Cylinde_BlockMesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0) 
    (20 0 0)
    (20 20 0)
    (0 20 0) 
    (7 7 0) 
    (13 7 0)
    (13 13 0)
    (7 13 0) 
  

    (0 0 1)
    (20 0 1)
    (20 20 1)
    (0 20 1) 
    (7 7 1) 
    (13 7 1)
    (13 13 1)
    (7 13 1) 
);

blocks
(
	hex (0 1 5 4 8 9 13 12) (100 100 1) simpleGrading (1 1 1)
	hex (5 1 2 6 13 9 10 14) (100 100 1) simpleGrading (1 1 1)
	hex (7 6 2 3 15 14 10 11) (100 100 1) simpleGrading (1 1 1)
	hex (0 4 7 3 8 12 15 11) (100 100 1) simpleGrading (1 1 1)
	
);

edges
(
	arc 4 5 (10 5.757359313 0)
	arc 5 6 (14.24264069 10 0)
	arc 6 7 (10 14.24264069 0)
	arc 7 4 (5.757359313 10 0)
	arc 12 13 (10 5.757359313 1)
	arc 13 14 (14.24264069 10 1)
	arc 14 15 (10 14.24264069 1)
	arc 15 12 (5.757359313 10 1)
	
);

boundary
(
    inlet
    {
        type wall;
        faces
        (
            (11 3 0 8)
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (10 2 1 9)    
        );
    }
    wall
    {
        type wall;
        faces
        (
            (11 3 2 10)
            (8 0 1 9)
	   
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (4 5 13 12)
	    (5 6 14 13)
	    (6 7 15 14)
	    (7 4 12 15)
    
        );
    }
    sides
    {
        type empty;
        faces
        (
	(0 1 5 4)
        (8 9 13 12)
	(5 1 2 6)
        (13 9 10 14) 
	(7 6 2 3)
        (15 14 10 11) 
	(0 4 7 3)
        (8 12 15 11) 
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
